In [3]:
import pandas as pd
data = {
    	'Name': ['Alice', 'Bob', 'Charlie'],
   	    'Age': [25, 30, 35],
	    'Salary': [50000, 60000, 75000]
	    }
df1 = pd.DataFrame(data)
print("Sample DataFrame:")
print(df1)
df1

Sample DataFrame:
      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000

In [2]:
import pandas as pd
df = pd.read_csv('../../dataset/vgsales.csv')
df.head()

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,259,Asteroids,2600,1980,Shooter,Atari,4.00,0.26,0.0,0.05,4.31
1,545,Missile Command,2600,1980,Shooter,Atari,2.56,0.17,0.0,0.03,2.76
2,1768,Kaboom!,2600,1980,Misc,Activision,1.07,0.07,0.0,0.01,1.15
3,1971,Defender,2600,1980,Misc,Atari,0.99,0.05,0.0,0.01,1.05
4,2671,Boxing,2600,1980,Fighting,Activision,0.72,0.04,0.0,0.01,0.77

In [5]:
df = pd.read_csv('../../dataset/vgsales.csv',header=None,names=['a','b','c','d','e','f'])
df.head()

,,,,,a,b,c,d,e,f
Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
259,Asteroids,2600,1980,Shooter,Atari,4,0.26,0,0.05,4.31
545,Missile Command,2600,1980,Shooter,Atari,2.56,0.17,0,0.03,2.76
1768,Kaboom!,2600,1980,Misc,Activision,1.07,0.07,0,0.01,1.15
1971,Defender,2600,1980,Misc,Atari,0.99,0.05,0,0.01,1.05

In [9]:
df = pd.read_csv('../../dataset/vgsales.csv',index_col=['Rank','Name'])
print(df.head())

                     Platform  Year     Genre   Publisher  NA_Sales  EU_Sales  \
Rank Name
259  Asteroids           2600  1980   Shooter       Atari      4.00      0.26
545  Missile Command     2600  1980   Shooter       Atari      2.56      0.17
1768 Kaboom!             2600  1980      Misc  Activision      1.07      0.07
1971 Defender            2600  1980      Misc       Atari      0.99      0.05
2671 Boxing              2600  1980  Fighting  Activision      0.72      0.04

                      JP_Sales  Other_Sales  Global_Sales
Rank Name
259  Asteroids             0.0         0.05          4.31
545  Missile Command       0.0         0.03          2.76
1768 Kaboom!               0.0         0.01          1.15
1971 Defender              0.0         0.01          1.05
2671 Boxing                0.0         0.01          0.77

In [13]:
df = pd.read_csv('../../dataset/vgsales.csv', index_col='Rank', usecols=['Rank','Name','Global_Sales','Other_Sales','JP_Sales'])
print(df.head())

                 Name  JP_Sales  Other_Sales  Global_Sales
Rank
259         Asteroids       0.0         0.05          4.31
545   Missile Command       0.0         0.03          2.76
1768          Kaboom!       0.0         0.01          1.15
1971         Defender       0.0         0.01          1.05
2671           Boxing       0.0         0.01          0.77